OpenDTEF-v1912/tutorials/multiphase/interMixingFoam/laminar/damBreak/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
cp 0/alpha.air.orig 0/alpha.air
cp 0/alpha.other.orig 0/alpha.other
cp 0/alpha.water.orig 0/alpha.water
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
